/*Практичне завдання №12, Вус Павло, ІПЗ-1, група №1 
 * У розкладі рейсів літаків дні тижня позначаються номерами від 1 до 7. Припустимо, що в програмі дні тижня подаються enum типом Weekd. 
 * Написати програму, що у відповідь на введення номера дня виводить текстове подання дня тижня.*/
import acm.program.ConsoleProgram;


public class Task2 extends ConsoleProgram{
	public void run(){
		getDayByNumber();
	}
	//Метод, який просить користувача ввести номер дня тижня і виводить відповідний елемент переліку
	private void getDayByNumber() {
		while(true){
			//Просимо ввести номер дня тижня
			int input = readInt("Введіть число від 1 до 7, щоб дізнатися відповідний день тижня: ");
			while(input < 1 || input > 7){
				input = readInt("Введіть число ВІД 1 ДО 7: ");
			}
			
			//Виводимо відповідний елемент переліку
			println("День тижня: " + Weekd.values()[input -1]);
			
			//Запитуємо чи користувач хоче продовжувати
			int choice = readInt("Продовжуємо? Введіть 1 для продовження або 0 для виходу:");
			while(true){
				if(choice == 0){
					println("Програма завершена!");
					return;
				} else if(choice == 1){
					break;
				} else if(choice != 0 && choice != 1){
					choice = readInt("Ви ввели інше число!!!. Вам потрібно ввести 1 для продовження або 0 для виходу:");
				} 
			}
		}
	}
}
