/* Завдання №5 лабораторної роботи №1, Вус Павло, ІПЗ-1, група №1
 * Написати програму, що зчитує з клавіатури цілі числа (по одному числу за раз), поки користувач не введе число 0 (ви маєте бути в змозі легко поміняти цю умову на якесь інше число).
 *  По закінченню вводу ваша програма має вивести найменше і найбільше число.
 *  Якщо користувач введе лише одне число, програма має повідомити що це число і найбільше і найменше
Якщо користувач в першій же стрічці введе символ закінчення вводу, тоді вважається, що жодного числа не було введено і програма має це повідомити.*/

import acm.program.ConsoleProgram;


public class Task5 extends ConsoleProgram{
	private static final int STOP = -10;
	public void run(){
		findSmallestAndLargest();
	}
//Метод, який виводить найбільше, найменше з ряду чисел і кількість введених чисел, доки цього хоче користувач
	private void findSmallestAndLargest() {
		while(true){
			println("Вводьту цілі числа, доки хочете,щоб зупинити ввід введіть " + STOP + " , тоді вам виведе найбільше і найменше з введеного ряду");
			//Декларуємо необхідні змінні
			int a;
			int MAX = STOP;
			int MIN =STOP;
			int counter = 0;
			
			//Розпочинаємо цикл, який виконується хочаб один раз і зупиняється, коли користувач ввів стоп-число
			do {
				a = readInt("Введіть ціле число:");
				if(MAX == STOP && MIN == STOP){
					MAX = a;
					MIN = a;
				} else if (a != STOP){
					if(MAX < a)
						MAX = a;
					if(MIN > a)
						MIN = a;
				}
				counter++;
			} while (a!=STOP);
			//Якщо користувач щось ввів, то виводимо найбільше і найменше, в протилежному випадку, повідомляємо, що нічого не введено
			if(MAX != STOP && MIN != STOP){
				println("Найбільше: " + MAX);
				println("Найменше: " + MIN);
			} else {
				println("Нічого не введено");
			}
			//Виводимо кіл-сть введених чисел
			println("Кількість введених чисел: " + (counter-1));
			
			//Запитуємо, чи користувач бажає продовжити
			int choice = readInt("Продовжуємо? Введіть 1 для продовження або 0 для виходу:");
			while(true){
				if(choice == 0){
					println("Програма завершена!");
					return;
				} else if(choice == 1){
					break;
				} else if(choice != 0 && choice != 1){
					choice = readInt("Ви ввели інше число!!!. Вам потрібно ввести 1 для продовження або 0 для виходу:");
				} 
			}
		}
	}
}
