/* Завдання №6 лабораторної роботи №1, Вус Павло, ІПЗ-1, група №1
 * Опис алгоритму:
- візьміть позитивне ціле число, назвемо його n
- якщо n парне, поділимо його на 2
- якщо n не парне, помножимой його на 3 і додамо 1
- продовжувати цей процес поки n не буде дорівнювати 1
Напишіть програму, що реалізує вказаний алгоритм і наочно проілюструє його виконання.
 В кінці обов'язково повідомити кількість кроків.*/

import acm.program.ConsoleProgram;


public class Task6 extends ConsoleProgram{
	public void run(){
		algoritmToOne();
	}
	
//Метод, який приймає початкове число і проганяє його через заданий алгоритм, доки цього хоче користувач
	private void algoritmToOne() {
		while(true){
			//Приймаємо натуральне число
			println("Введіть число, щоб відслідкувати його перетвореня в 1 через вказані дії:");
			int a = readInt("Початкове число: ");
			while (true){
				if(a <= 0){
					a = readInt("Введіть НАТУРАЛЬНЕ початкове число: ");
				} else {
					break;
				}
			}
			
			transformToOne(a);
			
			//Запитуємо, чи користувач бажає продовжити
			int choice = readInt("Продовжуємо? Введіть 1 для продовження або 0 для виходу:");
			while(true){
				if(choice == 0){
					println("Програма завершена!");
					return;
				} else if(choice == 1){
					break;
				} else if(choice != 0 && choice != 1){
					choice = readInt("Ви ввели інше число!!!. Вам потрібно ввести 1 для продовження або 0 для виходу:");
				} 
			}
		}
		
	}
//Метод, який приймає початкове число, проганяє через алгоритм, виводить кожен крок і в кінці виводить фінальну кіл-сть кроків
	private void transformToOne(int n) {
		int counter = 0;
		while(n != 1){
			if (n % 2 == 0){
				println(n + ":2 -------> " + n/2 );
				n = n/2;
				counter++;
			} else {
				println(n + "*3 -------> " + (n*3 + 1));
				n = n*3 + 1;
				counter++;
			}
		}
		println("Перехід завершено!!!");
		println("Кількість кроків для переходу: " + counter);
	}
}
