/* Домашня робота №6,завдання №1, Вус Павло, ІПЗ-1, група №1

 * Програма має рахувати числа Фібоначі і виводити результати на екран у формі:
0 - 0
1 - 1
2 - 1
3 - 2
і так далі
Користувач вводить число яке обмежує значення максимального числа Фібоначі, що має бути обраховане. 
Тобто вивід триває поки значення наступного числа фібоначі не перевищує введене користувачем число.*/

import acm.program.ConsoleProgram;


public class Task1 extends ConsoleProgram{
	public void run(){
		while(true){
			println("Програма обраховує всі числа Фібоначчі, які не більші від вказаного користувачем");
			//Запитуємо ввести ціле невід'ємне число
			int n = readInt("Введіть ціле невід'ємне число, яке буде межею чисел Фібоначчі: ");
			while (true){
				if(n < 0){
					n = readInt("Введіть ЦІЛЕ НЕВІД'ЄМНЕ число: ");
				} else {
					break;
				}
			}
			//Обраховуємо всі числа Фібоначчі до заданого і виводимо
			println("Числа Фібоначчі, які не більші за " + n + ":");
			for(int i = 0; fibRecur(i) <= n; i++){
				println(i + " - " + fibRecur(i));
			}
			
			//Запитуємо, чи користувач бажає продовжити
			int choice = readInt("Продовжуємо? Введіть 1 для продовження або 0 для виходу:");
			while(true){
				if(choice == 0){
					println("Програма завершена!");
					return;
				} else if(choice == 1){
					break;
				} else if(choice != 0 && choice != 1){
					choice = readInt("Ви ввели інше число!!!. Вам потрібно ввести 1 для продовження або 0 для виходу:");
				} 
			}
		}
	}
//Метод, який рекурсивно обраховує число Фібоначчі
	private int fibRecur (int n) {
		if (n == 0)
			return 0;
		if (n == 1)
			return 1;
		return fibRecur(n-1) + fibRecur(n-2);
		
	}
}
